{
	"Resumo Profissional": "Embora a formação seja em Arquitetura, e a experiência profissional ainda não se tenha voltado para a tecnologia da informação, o verdadeiro talento natural e direção profissional sempre estiveram fortemente ligados aos computadores.<br />O primeiro contato com um computador ocorreu há 30 anos, e nos últimos 15 anos dedica grande parte do tempo ao aperfeiçoamento e à experimentação autodirigidos na área de TI. Isso resultou na capacidade de assimilar facilmente qualquer linguagem, em especial projetos utilizando Java, JavaScript, TypeScript, HTML, CSS, PHP e Python, entre outros, como pode ser visto no portfólio.<br />Além disso, também desenvolveu habilidades em uma série de frameworks e bibliotecas, como Spring Boot, Node.js, Vue.js, React, Angular, e pré-processadores CSS como Sass, SCSS e Less. Outra habilidade se dá com bancos de dados relacionais, particularmente MySQL, e manipulação de APIs RESTful com operações CRUD.<br />No momento concentra-se na busca por uma oportunidade de discutir mais profundamente as experiências relevantes e demonstrar como a compreensão da tecnologia, juntamente com a formação única em Arquitetura, coloca-se em uma posição única para contribuir com qualquer equipe.<br />TL;DR: Arquiteto, notável talento natural em TI, experiência autodirigida não-formal de 15 anos. Trabalha com Java, JavaScript, TypeScript, HTML, CSS, PHP e Python, e também frameworks e pré-processadores CSS. Tem habilidade com MySQL e APIs RESTful com operações CRUD. Busca oportunidade para aplicar sua expertise em uma equipe de desenvolvimento.",
	"Formação": "Bacharel em Arquitetura e Urbanismo – Unifra (2010-2018)",
	"Atividades Extracurriculares": "Intercâmbio Acadêmico – Ciência sem Fronteiras, Universidade de Pécs, Hungria (2014)",
	"Habilidades Técnicas": "•\tLinguagens de Programação: Java, JavaScript, TypeScript, HTML, CSS, PHP, Python<br />•\tFrameworks e Bibliotecas: Vue.js, React, Node.js, Angular, Spring Boot, Sass, SCSS, Less<br />•\tBancos de Dados: MySQL<br />•\tFerramentas e Tecnologias: Git, REST API, CRUD, Photoshop, CAD, Stable Diffusion",
	"Experiência da Arquitetura": "Possui 9 anos de experiência na área de arquitetura, com habilidades desenvolvidas em:<br />•\tAnálise de projetos e identificação de desafios, propondo soluções criativas e eficientes;<br />•\tDesenho e visualização de planos detalhados para projetos, otimizando a satisfação e engajamento de clientes;<br />•\tUso de softwares de modelagem 3D, ferramentas CAD e outras tecnologias de arquitetura para maximizar a produtividade.",
	"Idiomas": "•\tInglês - Proficiência avançada, com habilidade em leitura e conversação, e competência moderada em escrita.",
	"Competências Interpessoais": "•\tCapacidade autodidata para compreensão rápida de novas tecnologias e conceitos de programação;<br />•\tProatividade na resolução de problemas, focando na aplicação eficaz de conhecimentos;<br />•\tProficiência intermediária a avançada em inglês, com habilidade de conversação e leitura, além de competência moderada na escrita;<br />•\tFoco na eficiência, com habilidade em identificar e aplicar abordagens práticas para a resolução de problemas e otimização de recursos.",
	"Portfólio de Projetos": "•\tExtensão para Verificar Seguidores no Instagram: Desenvolvimento de uma extensão para o Chrome que oferece ao usuário a possibilidade de verificar se as pessoas que ele segue estão seguindo de volta, diretamente do navegador. Isso melhora a experiência do usuário e a conveniência no gerenciamento de seguidores no Instagram. Disponível na Chrome Store e com link no meu perfil do LinkedIn.<br /> ablbuble",
	"Histórico com os Computadores – TL;DR;": "•\tFascínio por tecnologia surgiu aos 3 anos, marcado pela interação com um computador no local de trabalho do pai.<br />•\tInterações tecnológicas continuaram na infância, com o primeiro contato com o Paint e aulas de informática, culminando na aquisição do primeiro computador em 1996.<br />•\tA adolescência foi marcada pela curiosidade técnica, destacando-se a tentativa de consertar um computador aos 15 anos.<br />•\tExperiências com desenvolvimento web começaram com a criação de sites em plataformas como GeoCities e HPG, aprendendo HTML e amando a experimentação tecnológica.<br />•\tAutomatização de tarefas foi explorada através da modificação de um bot no jogo Ragnarok Online, aprendendo Perl e gerando lucro com venda de itens.<br />•\tTransição por diversas plataformas de internet e redes sociais marcou a jornada digital, com destaque para pioneirismo ao criar um e-mail no Gmail.<br />•\tTeve experiência em montagem e manutenção de hardware, mas o mercado local mostrou-se limitado.<br />•\tTentativa de ingressar em um curso técnico em informática foi barrada por restrições de idade, apesar do apoio dos pais.<br />•\tEm 2009, optou por cursar Arquitetura e Urbanismo, um outro campo de interesse. Atuou profissionalmente até o final de 2022, quando decidiu mudar de carreira para a Tecnologia da Informação.<br />•\tExperiências expandiram para além do hardware, abrangendo o desenvolvimento de homepages, criando uma base sólida no entendimento do código HTML.<br />•\tA base em HTML facilitou a transição para a TI, absorvendo rapidamente novos conhecimentos para busca de oportunidades de trabalho na área.<br />•\t12. Tentativas de migração para TI ocorreram em 2019 e 2021, mas compromissos da época impediram a mudança. A decisão definitiva de mudança de carreira foi tomada e executada, consolidando o ingresso na TI.",
	"Histórico com os Computadores – Versão do Diretor": "O fascínio por tecnologia e computadores começou cedo, por volta dos 3 anos de idade, com uma experiência notável ocorrendo durante uma visita ao local de trabalho do pai. A oportunidade de interagir com um dos computadores do Banco Real se apresentou, resultando em um fascínio duradouro por telas de fundo escuro e letras verdes.<br />,<br />As interações com a tecnologia continuaram ao longo da infância, destacando-se a experiência com um computador na casa de um primo, onde houve o primeiro contato com o programa Paint. Aos 6 anos, já na escola, foram realizadas aulas de informática que precederam a aquisição do primeiro computador pessoal no Natal de 1996. Embora as oportunidades de uso fossem limitadas pela idade, este foi o início de uma longa jornada de exploração e aprendizado autodirigido.<br />,A vivência na adolescência incluiu momentos significativos, como a tentativa de consertar o computador de uma prima aos 15 anos. Mesmo sem um conhecimento completo de todos os aspectos técnicos, como a importância dos drivers, a curiosidade e a disposição para aprender estavam sempre presentes.<br />Com o passar do tempo, a experimentação se expandiu para além do hardware, abrangendo o desenvolvimento de websites e a interação com diversas plataformas online. Websites foram criados em plataformas como GeoCities, HPG, Bol e AOL, utilizando ferramentas como HomeSite, Dreamweaver, Fireworks e Flash. Essa exposição inicial ao desenvolvimento web proporcionou uma compreensão aprofundada do código HTML e reforçou o amor pela experimentação tecnológica.<br />Um traço distintivo que se manifestou nesse período foi o desejo de automatizar tarefas para eliminar processos repetitivos. Isso levou a diversas experiências de automação, notavelmente no jogo Ragnarok Online. Apesar de um conhecimento ainda inicial de programação, a linguagem Perl foi aprendida e aplicada para modificar um bot de jogo, facilitando a coleta de itens no jogo e, finalmente, gerando um lucro real através da venda destes itens no Mercado Livre. A solução foi tão eficaz que inspirou muitos outros jogadores a seguirem o mesmo caminho, forçando a Gravity, a desenvolvedora do jogo, a implementar um patch para evitar o abuso da troca desses itens.<br />A jornada digital também foi marcada pela transição por diversas plataformas de internet e redes sociais desde o advento da internet no Brasil. Começou com a utilização do provedor Zaz para acessar a internet discada, e continuou por diversas ferramentas de comunicação, como ICQ, chat do Terra, mIRC, MSN e Skype. A exploração das redes sociais se iniciou desde os primórdios com o Orkut, até chegar ao Facebook, Instagram e WhatsApp. Vale ressaltar que houve um pioneirismo ao criar o primeiro e-mail no Gmail quando ainda era necessário receber um convite, demonstrando uma constante curiosidade em adotar e experimentar novas tecnologias.<br />Houve também uma experiência no campo de montagem e manutenção de hardware, após a conclusão de um curso específico para essa área. Apesar de ter atendido a alguns clientes, a realidade do mercado local naquela época se mostrou limitada, resultando em uma experiência breve. Durante o período escolar, cogitou-se iniciar um curso técnico em informática, contudo, devido a restrições de idade, a oportunidade não se concretizou, pois ainda não se havia atingido a maioridade.<br />Os pais, sempre incentivadores e conscientes das inclinações para a informática, apresentaram a ideia de iniciar um curso técnico na área. Juntos, realizaram conversas com a direção do curso para encontrar possíveis soluções diante do obstáculo de idade. Entretanto, não foi possível contornar a restrição, pois ainda não se havia atingido a maioridade.<br />Em 2009, o caminho da informática sofreu um desvio. Foram realizadas as provas para ingresso em Engenharia da Computação, onde ficou como suplente, e o Exame Nacional do Ensino Médio (ENEM). Por meio do ENEM, optou-se por cursar Arquitetura e Urbanismo, um outro campo de interesse. O percurso acadêmico foi aprimorado com uma experiência internacional durante um intercâmbio. Após a formação, a carreira de arquiteto se seguiu até o final de 2022. No entanto, a paixão pela informática permaneceu latente durante todo esse tempo. Com a coragem amadurecida e o apoio incondicional da família, a decisão de mudança de carreira foi tomada, determinando o ingresso no mundo da Tecnologia da Informação.<br />Com o passar do tempo, as experiências se expandiram para além do hardware, abrangendo o desenvolvimento de homepages e a interação com diversas plataformas online. Homepages foram criadas em plataformas como GeoCities, HPG, Bol e AOL, utilizando ferramentas como HomeSite, Dreamweaver, Fireworks e Flash. Essa exposição inicial ao desenvolvimento web proporcionou uma compreensão aprofundada do código HTML e reforçou o amor pela experimentação tecnológica.<br />Essa exposição inicial ao desenvolvimento de homepages instaurou uma base sólida no entendimento do código HTML. Esta base facilitou a rápida transição de carreira para a tecnologia da informação, permitindo a absorção acelerada de novos conhecimentos necessários para a busca de oportunidades de trabalho na área.<br />Em 2009, o caminho da informática sofreu um desvio. Foram realizadas as provas para ingresso em Engenharia da Computação, onde ficou como suplente, e o Exame Nacional do Ensino Médio (ENEM). Por meio do ENEM, optou-se por cursar Arquitetura e Urbanismo, um outro campo de interesse. O percurso acadêmico foi aprimorado com uma experiência internacional durante um intercâmbio. Posteriormente, em 2019 e 2021, houve duas tentativas de migração para o campo da tecnologia da informação. Na primeira oportunidade, foi aprovado no curso de Redes de Computadores da UFSM através da modalidade 'portador de diploma'. Na segunda, foi aprovado para o curso de 'Sistemas de Informação' da mesma universidade, também na modalidade de 'portador de diploma'. Entretanto, devido a compromissos da época, não foi possível prosseguir com a mudança. Após a formação em Arquitetura, a carreira de arquiteto se seguiu até o final de 2022. No entanto, o interesse pela informática permaneceu latente durante todo esse tempo. Após uma reflexão madura e com o apoio da família, a decisão de mudança de carreira foi finalmente tomada e executada, consolidando o ingresso no mundo da Tecnologia da Informação."
}
